In [1]:
import pandas as pd
import seaborn as sns

apply

In [2]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df['ten'] = 10
df

      age     fare  ten
0    22.0   7.2500   10
1    38.0  71.2833   10
2    26.0   7.9250   10
3    35.0  53.1000   10
4    35.0   8.0500   10
..    ...      ...  ...
886  27.0  13.0000   10
887  19.0  30.0000   10
888   NaN  23.4500   10
889  26.0  30.0000   10
890  32.0   7.7500   10

[891 rows x 3 columns]

In [3]:
def add_5(n):
    return n + 5
def mpg_to_kpl(mpg):
    return mpg * 0.42514

In [4]:
a = [1, 2, 3, 4, 5]
list(map(add_5, a))

[6, 7, 8, 9, 10]

In [5]:
sr1 = df['ten'].apply(add_5)
sr1

0      15
1      15
2      15
3      15
4      15
       ..
886    15
887    15
888    15
889    15
890    15
Name: ten, Length: 891, dtype: int64

In [7]:
df['ten'] = df['ten'].apply(add_5)
df

      age     fare  ten
0    22.0   7.2500   15
1    38.0  71.2833   15
2    26.0   7.9250   15
3    35.0  53.1000   15
4    35.0   8.0500   15
..    ...      ...  ...
886  27.0  13.0000   15
887  19.0  30.0000   15
888   NaN  23.4500   15
889  26.0  30.0000   15
890  32.0   7.7500   15

[891 rows x 3 columns]

In [8]:
df['age'] = df['age'].apply(mpg_to_kpl)
df

          age     fare  ten
0     9.35308   7.2500   15
1    16.15532  71.2833   15
2    11.05364   7.9250   15
3    14.87990  53.1000   15
4    14.87990   8.0500   15
..        ...      ...  ...
886  11.47878  13.0000   15
887   8.07766  30.0000   15
888       NaN  23.4500   15
889  11.05364  30.0000   15
890  13.60448   7.7500   15

[891 rows x 3 columns]

Column Order

In [9]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
df = titanic.loc[0:4, 'survived':'age']
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [12]:
df.columns

Index(['survived', 'pclass', 'sex', 'age'], dtype='object')

In [13]:
df.columns.values

array(['survived', 'pclass', 'sex', 'age'], dtype=object)

In [14]:
type(df.columns)

pandas.core.indexes.base.Index

In [15]:
type(df.columns.values)

numpy.ndarray

In [16]:
columns = list(df.columns)
columns

['survived', 'pclass', 'sex', 'age']

In [17]:
columns_sorted = sorted(columns, reverse=True)
columns_sorted

['survived', 'sex', 'pclass', 'age']

In [18]:
df_sorted = df[columns_sorted]
df_sorted

   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

In [20]:
columns_customed = ['pclass', 'sex', 'age', 'survived']
df_customed = df[columns_customed]
df_customed

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

Filter

In [23]:
titanic.survived.value_counts()[1]/len(titanic)

0.3838383838383838

In [24]:
titanic.survived.sum()/titanic.shape[0]

0.3838383838383838

In [25]:
df_teenage = titanic.loc[(titanic['age'] >= 10) & (titanic['age'] < 20)]
df_teenage.info()
df_teenage.survived.sum()/len(df_teenage)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 102 entries, 9 to 887
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     102 non-null    int64
 1   pclass       102 non-null    int64
 2   sex          102 non-null    object
 3   age          102 non-null    float64
 4   sibsp        102 non-null    int64
 5   parch        102 non-null    int64
 6   fare         102 non-null    float64
 7   embarked     102 non-null    object
 8   class        102 non-null    category
 9   who          102 non-null    object
 10  adult_male   102 non-null    bool
 11  deck         19 non-null     category
 12  embark_town  102 non-null    object
 13  alive        102 non-null    object
 14  alone        102 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 10.4+ KB

0.4019607843137255

In [28]:
df_female_under10 = titanic.loc[(titanic['age'] < 10) & (titanic['sex'] == 'female')]
df_female_under10.info()
df_female_under10.survived.sum()/len(df_female_under10)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 10 to 852
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     30 non-null     int64
 1   pclass       30 non-null     int64
 2   sex          30 non-null     object
 3   age          30 non-null     float64
 4   sibsp        30 non-null     int64
 5   parch        30 non-null     int64
 6   fare         30 non-null     float64
 7   embarked     30 non-null     object
 8   class        30 non-null     category
 9   who          30 non-null     object
 10  adult_male   30 non-null     bool
 11  deck         4 non-null      category
 12  embark_town  30 non-null     object
 13  alive        30 non-null     object
 14  alone        30 non-null     bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 3.4+ KB

0.6333333333333333

In [34]:
df_under10_morethan60 = titanic.loc[(titanic['age'] < 10) | (titanic['age'] >= 60)]
df_under10_morethan60.info()
df_under10_morethan60.survived.sum()/len(df_under10_morethan60)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 88 entries, 7 to 869
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     88 non-null     int64
 1   pclass       88 non-null     int64
 2   sex          88 non-null     object
 3   age          88 non-null     float64
 4   sibsp        88 non-null     int64
 5   parch        88 non-null     int64
 6   fare         88 non-null     float64
 7   embarked     87 non-null     object
 8   class        88 non-null     category
 9   who          88 non-null     object
 10  adult_male   88 non-null     bool
 11  deck         23 non-null     category
 12  embark_town  87 non-null     object
 13  alive        88 non-null     object
 14  alone        88 non-null     bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 9.1+ KB

0.5113636363636364

In [36]:
df_under10_morethan60_female = titanic.loc[((titanic['age'] < 10) | (titanic['age'] >= 60)) & (titanic['sex'] =='female')]
df_under10_morethan60_female.survived.sum()/len(df_under10_morethan60_female)

0.6764705882352942

In [41]:
filter_under10 = titanic.age < 10
filter_morethan60 = titanic.age >= 60
filter_female = titanic.sex == 'female'
df_under10_morethan60_female = titanic.loc[(filter_under10 | filter_morethan60) & filter_female]
df_under10_morethan60_female.survived.sum()/df_under10_morethan60_female.shape[0]

0.6764705882352942

In [40]:
mask1

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: age, Length: 891, dtype: bool

In [42]:
titanic.sibsp.unique()

array([1, 0, 3, 4, 2, 5, 8], dtype=int64)

In [51]:
isin_filter = titanic.sibsp.isin([2, 4, 5])
df_isin = titanic.loc[isin_filter]
df_isin.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
38,0,3,female,18.0,2,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
48,0,3,male,NaN,2,0,21.6792,C,Third,man,True,NaN,Cherbourg,no,False
50,0,3,male,7.0,4,1,39.6875,S,Third,child,False,NaN,Southampton,no,False
59,0,3,male,11.0,5,2,46.9000,S,Third,child,False,NaN,Southampton,no,False

In [50]:
import numpy as np
a = np.array([1, 2, 3, 4, 5, 6, 7])
a[[True, False, True, False, True, False, True]]

array([1, 3, 5, 7])

Concat

In [52]:
df1 = pd.DataFrame({
    'a':['a0', 'a1', 'a2', 'a3'],
    'b':['b0', 'b1', 'b2', 'b3'],
    'c':['c0', 'c1', 'c2', 'c3']},
    index=[0, 1, 2, 3])
df2 = pd.DataFrame({
    'a':['a2', 'a3', 'a4', 'a5'],
    'b':['b2', 'b3', 'b4', 'b5'],
    'c':['c2', 'c3', 'c4', 'c5'],
    'd':['d2', 'd3', 'd4', 'd5']},
    index=[2, 3, 4, 5])
print(df1)
print(df2)

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3
    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [57]:
result = pd.concat([df1, df2])
result

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [58]:
result.loc[2]

    a   b   c    d
2  a2  b2  c2  NaN
2  a2  b2  c2   d2

In [59]:
result = pd.concat([df1, df2], ignore_index=True)
result

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [60]:
result.loc[2]

a     a2
b     b2
c     c2
d    NaN
Name: 2, dtype: object

In [61]:
result = pd.concat([df1, df2], axis='columns')
result

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [64]:
result = pd.concat([df1, df2], axis=1, join='inner')
result

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [65]:
result = pd.concat([df1, df2], axis=1, join='outer')
result

     a    b    c    a    b    c    d
0   a0   b0   c0  NaN  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN  NaN
2   a2   b2   c2   a2   b2   c2   d2
3   a3   b3   c3   a3   b3   c3   d3
4  NaN  NaN  NaN   a4   b4   c4   d4
5  NaN  NaN  NaN   a5   b5   c5   d5

In [66]:
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name='e')
sr1

0    e0
1    e1
2    e2
3    e3
Name: e, dtype: object

In [67]:
result = pd.concat([df1, sr1], axis=1)
result

    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

In [68]:
df1['e'] = sr1
df1

    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

In [71]:
sr2 = pd.Series(['f0', 'f1', 'f2'], name='f', index=[4, 3, 5])
sr2

4    f0
3    f1
5    f2
Name: f, dtype: object

In [72]:
result = pd.concat([sr1, sr2], axis=1)
result

     e    f
0   e0  NaN
1   e1  NaN
2   e2  NaN
3   e3   f1
4  NaN   f0
5  NaN   f2

In [74]:
result = pd.concat([df2, sr2], axis=1)
result

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f1
4  a4  b4  c4  d4   f0
5  a5  b5  c5  d5   f2

In [75]:
df2['f'] = sr2

In [76]:
df2

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f1
4  a4  b4  c4  d4   f0
5  a5  b5  c5  d5   f2